wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
/*!
    \file    gd32_bldc_foc_eval.c
    \brief   manage leds, keys, oled and COM ports in board

    \version 2025-06-30, V1.0.0, GDFOC2.0 for GD32F30x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32_bldc_foc_eval.h"
#include "foc_soft_delay.h"
#include "gd32_bldc_foc_oledfont.h"
#include "gd32_bldc_foc_oledbmp.h"
#include "gdfoc_config.h"
#include "systick.h"

/* SH1106 config */
#define SH1106_COLUMN_LENGTH            (128U)          /* column length */
#define SH1106_ROW_LENGTH               (64U)           /* row length */
#define SH1106_PAGE_LENGTH              (8U)            /* page length */
#define SH1106_I2C_SLAVE_ADDRESS7       (0x78U)         /* i2c slave address */
#define SH1106_BRIGHTNESS               (0xffU)         /* SH1106 brightess */
#define SH1106_I2C_TIMEOUT              (65530U)        /* time out for i2c */

/* multilevel menu length */
#define MENU_LENGTH                     30              /* multilevel menu length */
#define MENU_START_PAGE                 0               /* information for start page*/
#define MENU_STATE_HOME                 1               /* information for state */
#define MENU_SETTING_HOME               2               /* information for setting */
#define MENU_MODE_SELECT                3               /* mode select */
#define MENU_DIRECTION                  4               /* direction config */
#define MENU_CURRENT                    5               /* current sample */
#define MENU_MODULATION                 6               /* modulation set */
#define MENU_OPENLOOP_VF                7               /* mode select: open loop mode ,VF start up */
#define MENU_OPENLOOP_IF                8               /* mode select: open loop mode ,IF start up*/
#define MENU_SMO_VF                     9               /* mode select: sliding mode observer ,VF start up */
#define MENU_SMO_IF                     10              /* mode select: sliding mode observer ,IF start up */
#define MENU_AFLUX_VF                   11              /* mode select: active flux observer ,VF start up */
#define MENU_AFLUX_IF                   12              /* mode select: active flux observer ,IF start up */
#define MENU_HALL_SENSOR_DETECT         13              /* mode select: HALL sensor installation angle indentification */
#define MENU_HALL_SENSOR                14              /* mode select: HALL sensor mode */
#define MENU_ENCODER_DETECT             15              /* mode select: encoder mode installation angle indentification */
#define MENU_ENCODER                    16              /* mode select: encoder mode */
#define MENU_CCW                        17              /* direction select: CCW */
#define MENU_CW                         18              /* direction select: CW */
#define MENU_3_SHUNT                    19              /* current sample: 3_shunt */
#define MENU_2_SHUNT                    20              /* current sample: 2_shunt */
#define MENU_1_SHUNT                    21              /* current sample: 1_shunt */
#define MENU_CBSVPWM                    22              /* pwm mode: CBSVPWM */
#define MENU_DSVPWM                     23              /* pwm mode: DSVPWM */
#define MENU_CSVPWM                     24              /* pwm mode: CSVPWM */
#define MENU_HINT                       25              /* hint page */

/* variable definition */
/* ec11 previous edge */
ec11_dege_enum pre_edge = AB_NONE;
/* ec11 end edge */
ec11_dege_enum end_edge = AB_NONE;
/* ec11 direction */
ec11_direction_enum ec_orientation = DIRECTION_INCREASE;

/* local variable definition */
static uint16_t delay_ec = 0;

/* static function */
/* initialize key */
static void key_init(void);
/* key read */
static FlagStatus key_read(key_switch_enum key_sw);
/* key read debouncing */
static FlagStatus key_read_debouncing(key_switch_enum key);
/* initialize the EC11 port */
static void ec_init(void);
/* initialize the led */
static void led_init(void);
/* turn on the selection led */
static void led_on(void);
/* turn off the selection led */
static void led_off(void);
/* initialize the SH1106 */
static void oled_init(void);
/* initialize the oled parameter */
static void oled_parameter_init(void);
/* I2C configuration for SH1106 */
static void i2c_config(void);
/* write data or command to SH1106 module */
static void oled_write_byte(uint8_t data, sh1106_cmd_enum type);
/* power calculation */
static uint32_t oled_pow(uint8_t m,uint8_t n);
/* clear all oled */
static void oled_clear_all(void);
/* clear page oled */
static void oled_clear(uint8_t start_page);
/* set oled display reverse */
static void oled_display_reverse(ControlStatus reverse);
/* oled display flip horizontally */
static void oled_flip_horizontal(ControlStatus flip);
/* refresh oled screen */
static void oled_page_refresh(void);
/* display a point */
static void oled_draw_point(uint8_t x, uint8_t y, uint8_t value);
/* display a picture */
static void oled_show_picture(uint8_t x,uint8_t y,uint8_t sizex,uint8_t sizey,uint8_t picture[]);
/* display a characters */
static void oled_show_char(uint8_t x,uint8_t y,uint8_t chr,oled_font_enum size);
/* display a string */
static void oled_show_string(uint8_t x,uint8_t y,uint8_t *chr,oled_font_enum size);
/* display a number at the specified location */
static void oled_show_num(uint8_t x, uint8_t y, uint16_t num, uint8_t len, oled_font_enum size);
/* display a line at the specified location */
static void oled_show_line(uint8_t x1,uint8_t y1,uint8_t x2,uint8_t y2);
/* show index start page */
static void fun_index_start(void);
/* show index 0 page */
static void fun_index1_0(void);
/* show index 1 page */
static void fun_index1_1(void);
/* show index 2 page */
static void fun_index2_2(void);
/* show index 3 page */
static void fun_index2_3(void);
/* show index 4 page */
static void fun_index2_4(void);
/* show index 5 page */
static void fun_index2_5(void);
/* show index 7 page */
static void fun_index3_7(void);
/* show index 8 page */
static void fun_index3_8(void);
/* show index 9 page */
static void fun_index3_9(void);
/* show index 10 page */
static void fun_index3_10(void);
/* show index 11 page */
static void fun_index3_11(void);
/* show index 12 page */
static void fun_index3_12(void);
/* show index 13 page */
static void fun_index3_13(void);
/* show index 14 page */
static void fun_index3_14(void);
/* show index 15 page */
static void fun_index3_15(void);
/* show index 16 page */
static void fun_index3_16(void);
/* show index 17 page */
static void fun_index3_17(void);
/* show index 18 page */
static void fun_index3_18(void);
/* show index 19 page */
static void fun_index3_19(void);
/* show index 20 page */
static void fun_index3_20(void);
/* show index 21 page */
static void fun_index3_21(void);
/* show index 22 page */
static void fun_index3_22(void);
/* show index 23 page */
static void fun_index3_23(void);
/* show index 24 page */
static void fun_index3_24(void);
/* show tip  page */
static void fun_index_hint(void);
/* show QR code */
static void oled_show_qr_code(uint8_t x,uint8_t y);

/* multilevel menu */
static key_index_struct menu_table[MENU_LENGTH]=
{
    /* level 0  */
    {MENU_START_PAGE,MENU_START_PAGE,MENU_START_PAGE,MENU_START_PAGE,fun_index_start},                      /* information for start page */

    /* level 1  */
    {MENU_STATE_HOME,MENU_STATE_HOME,MENU_STATE_HOME,MENU_SETTING_HOME,fun_index1_0},                       /* information for state */
    {MENU_SETTING_HOME,MENU_MODE_SELECT,MENU_SETTING_HOME,MENU_STATE_HOME,fun_index1_1},                    /* information for setting */
    
    /* level 2 */
    {MENU_MODE_SELECT,MENU_DIRECTION,MENU_SETTING_HOME,MENU_OPENLOOP_VF,fun_index2_2},                      /* mode select */
    {MENU_DIRECTION,MENU_CURRENT,MENU_MODE_SELECT,MENU_CCW,fun_index2_3},                                   /* direction config */
    {MENU_CURRENT,MENU_MODULATION,MENU_DIRECTION,MENU_3_SHUNT,fun_index2_4},                                /* current sample */
    {MENU_MODULATION,MENU_MODULATION ,MENU_CURRENT,MENU_DSVPWM,fun_index2_5},                               /* modulation set */
    
