wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
    /* level 3: mode select */
    {MENU_OPENLOOP_VF,MENU_OPENLOOP_VF,MENU_OPENLOOP_IF,MENU_MODE_SELECT,fun_index3_7},                     /* mode select: open loop mode ,VF start up */
    {MENU_OPENLOOP_IF,MENU_OPENLOOP_VF,MENU_SMO_VF,MENU_MODE_SELECT,fun_index3_8},                          /* mode select: open loop mode ,IF start up*/
    {MENU_SMO_VF,MENU_OPENLOOP_IF,MENU_SMO_IF,MENU_MODE_SELECT,fun_index3_9},                               /* mode select: sliding mode observer ,VF start up */
    {MENU_SMO_IF,MENU_SMO_VF,MENU_AFLUX_VF,MENU_MODE_SELECT,fun_index3_10},                                 /* mode select: sliding mode observer ,IF start up */
    {MENU_AFLUX_VF,MENU_SMO_IF,MENU_AFLUX_IF,MENU_MODE_SELECT,fun_index3_11},                               /* mode select: active flux observer ,VF start up */
    {MENU_AFLUX_IF,MENU_AFLUX_VF,MENU_HALL_SENSOR_DETECT,MENU_MODE_SELECT,fun_index3_12},                   /* mode select: active flux observer ,IF start up */
    {MENU_HALL_SENSOR_DETECT,MENU_AFLUX_IF,MENU_HALL_SENSOR,MENU_MODE_SELECT,fun_index3_13},                /* mode select: HALL sensor installation angle indentification */
    {MENU_HALL_SENSOR,MENU_HALL_SENSOR_DETECT,MENU_ENCODER_DETECT,MENU_MODE_SELECT,fun_index3_14},          /* mode select: HALL sensor mode */    
    {MENU_ENCODER_DETECT,MENU_HALL_SENSOR,MENU_ENCODER,MENU_MODE_SELECT,fun_index3_15},                     /* mode select: encoder mode installation angle indentification */
    {MENU_ENCODER,MENU_ENCODER_DETECT,MENU_ENCODER,MENU_MODE_SELECT,fun_index3_16},                         /* mode select: encoder mode */

    /* level 3: direction config */
    {MENU_CCW,MENU_CCW,MENU_CW,MENU_DIRECTION,fun_index3_17},                                               /* direction select: CCW */
    {MENU_CW,MENU_CCW,MENU_CW,MENU_DIRECTION,fun_index3_18},                                                /* direction select: CW */
    
    /* level 3: current sample */
    {MENU_3_SHUNT,MENU_3_SHUNT,MENU_2_SHUNT,MENU_CURRENT,fun_index3_19},                                    /* current sample: 1_shunt */
    {MENU_2_SHUNT,MENU_3_SHUNT,MENU_1_SHUNT,MENU_CURRENT,fun_index3_20},                                    /* current sample: 2_shunt */
    {MENU_1_SHUNT,MENU_2_SHUNT,MENU_1_SHUNT,MENU_CURRENT,fun_index3_21},                                    /* current sample: 3_shunt */
    
    /* level 3: pwm mode */
    {MENU_CBSVPWM,MENU_CBSVPWM,MENU_DSVPWM,MENU_MODULATION,fun_index3_22},                                  /* pwm mode: CBSVPWM */
    {MENU_DSVPWM,MENU_DSVPWM,MENU_CSVPWM,MENU_MODULATION,fun_index3_23},                                    /* pwm mode: DSVPWM */
    {MENU_CSVPWM,MENU_DSVPWM,MENU_CSVPWM,MENU_MODULATION,fun_index3_24},                                    /* pwm mode: CSVPWM */
    
    /* tip page  */
    {MENU_HINT,MENU_HINT,MENU_HINT,MENU_MODE_SELECT,fun_index_hint},                                        /* hint page */
};
/* current index */
static uint8_t func_index = MENU_START_PAGE;
/* previous index */
static uint8_t func_index_pre = MENU_START_PAGE;
/* SH1106 RAM data */
static uint8_t oled_buffer[SH1106_COLUMN_LENGTH][SH1106_PAGE_LENGTH] = {0xff};
/* current display interface */
void (*display_menu)(void);

/*!
    \brief      initialize board
    \param[in]  none
    \param[out] none
    \retval     none
*/
void eval_board_init(void)
{
    /* initialize keys */
    key_init();
    /* initialize the EC11 port */
    ec_init();
    /* initialize the GPIO port of LED */
    led_init();
    /* initialize the SH1106 */
    oled_init();
}

/*!
    \brief      delay stabilization
    \param[in]  num: number of software delays
    \param[out] none
    \retval     none
*/
void ec_delay(uint16_t num)
{
    for(delay_ec=0; delay_ec<num; delay_ec++);
}

/*!
    \brief      handle at one effective edge
    \param[in]  num
    \param[out] none
    \retval     none
*/
void ec11_handle(void)
{
    switch(motor.state){
        case MC_STATE_INIT:
            break;
        
        case MC_STATE_IDLE:
            if(DIRECTION_INCREASE == ec_orientation){
                func_index = menu_table[func_index].up_index;
                if(MENU_STATE_HOME == func_index){
                    /* adjust reference speed */
                    motor.speed_ref += SPEED_REFERENCE_STEPPING;
                    if(motor.speed_ref > SPEED_REFERENCE_MAX){
                        motor.speed_ref = SPEED_REFERENCE_MAX;
                    }
                }
            }else if(DIRECTION_DECREASE == ec_orientation){
                func_index = menu_table[func_index].down_index;
                if(MENU_STATE_HOME == func_index){
                    /* adjust reference speed */
                    if(motor.speed_ref <= SPEED_REFERENCE_MIN){
                        motor.speed_ref = SPEED_REFERENCE_MIN;
                    }
                    else{
                        motor.speed_ref -= SPEED_REFERENCE_STEPPING;
                    }
                }
            }
            break;
        
        case MC_STATE_RUNNING:
            if(DIRECTION_INCREASE == ec_orientation){
                /* adjust reference speed */
                motor.speed_ref += SPEED_REFERENCE_STEPPING;
                if(motor.speed_ref > SPEED_REFERENCE_MAX){
                    motor.speed_ref = SPEED_REFERENCE_MAX;
                }
            }else if(DIRECTION_DECREASE == ec_orientation){
                /* adjust reference speed */
                if(motor.speed_ref <= SPEED_REFERENCE_MIN){
                    motor.speed_ref = SPEED_REFERENCE_MIN;
                }
                else{
                    motor.speed_ref -= SPEED_REFERENCE_STEPPING;
                }
            }
            break;

        case MC_STATE_BRAKE: {
            break;
        }

        case MC_STATE_FAULT: {
            break;
        }
        default:
            break;
    }
    
}

/*!
    \brief      key process
    \param[in]  none
    \param[out] none
    \retval     none
*/
void key_process(void)
{
    switch(motor.state){
        case MC_STATE_INIT:
            /* start page */
            func_index_pre = func_index;
            func_index = menu_table[MENU_STATE_HOME].current_index;
            break;
        
        case MC_STATE_IDLE:
            if(key_read_debouncing(KEY_RUN)){
                /* start motor */
                motor.command = MC_START;
                /* run homepage */
                func_index_pre = func_index;
                func_index = menu_table[MENU_STATE_HOME].current_index;
            }
            
            /* confirm key */
            if(key_read_debouncing(KEY_ENTER)){

                if(MENU_OPENLOOP_VF == menu_table[func_index].current_index ){
                    /* mode select: open loop mode ,VF start up */
                    motor.running_mode = OPENLOOP_VF;
                }else if(MENU_OPENLOOP_IF == menu_table[func_index].current_index){
                    /* mode select: open loop mode ,IF start up */
                    motor.running_mode = OPENLOOP_IF;
                }else if(MENU_SMO_VF == menu_table[func_index].current_index ){
                     /* mode select: sliding mode observer ,VF start up */
                    motor.running_mode = SMO_VF;
                }else if(MENU_SMO_IF == menu_table[func_index].current_index ){
                    /* mode select: sliding mode observer ,IF start up */
                    motor.running_mode = SMO_IF;
                }else if(MENU_AFLUX_VF == menu_table[func_index].current_index ){
                     /* mode select: active flux observer ,VF start up */
                    motor.running_mode = AFLUX_VF;
                }else if(MENU_AFLUX_IF == menu_table[func_index].current_index ){
                    /* mode select: active flux observer ,IF start up */
                    motor.running_mode = AFLUX_IF;
                }else if(MENU_HALL_SENSOR_DETECT == menu_table[func_index].current_index){
                    /* mode select: HALL sensor installation angle indentification */
                    motor.running_mode = HALL_SENSOR_DETECT;
                }else if(MENU_HALL_SENSOR == menu_table[func_index].current_index){
                    /* mode select: HALL sensor mode */
                    motor.running_mode = HALL_SENSOR;
                }else if(MENU_ENCODER_DETECT == menu_table[func_index].current_index){
                    /* mode select: encoder detect mode */
                    motor.running_mode = ENCODER_DETECT;
                }else if(MENU_ENCODER == menu_table[func_index].current_index){
                    /* mode select: encoder detect mode */
                    motor.running_mode = ENCODER;
                }else if(MENU_CCW == menu_table[func_index].current_index){
                    /* direction select: CCW */
                    motor.direction = DIRECTION_CCW;
                }else if(MENU_CW == menu_table[func_index].current_index){
                     /* direction select: CW */
                    motor.direction = DIRECTION_CW;
                }else if(MENU_1_SHUNT == menu_table[func_index].current_index){
                    /* current sample: 1_shunt */
                    pwm_current.samp_mode = CURRENT_1SHUNT;
                }else if(MENU_2_SHUNT == menu_table[func_index].current_index){
                    /* current sample: 2_shunt */
                    pwm_current.samp_mode = CURRENT_2SHUNT;
                }else if(MENU_3_SHUNT == menu_table[func_index].current_index){
                    /* current sample: 3_shunt */
                    pwm_current.samp_mode = CURRENT_3SHUNT;
                }else if(MENU_DSVPWM == menu_table[func_index].current_index){
                    /* pwm mode: DSVPWM */
                    pwm_current.pwm_mode = DSVPWMMIN;
                }else if(MENU_CSVPWM == menu_table[func_index].current_index){
                    /* pwm mode: CSVPWM */
                    pwm_current.pwm_mode = CSVPWM;
                }

