wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
                /* change max modulation degree */
                /* current sample: 1_shunt */
                if(pwm_current.samp_mode == CURRENT_1SHUNT){
                    motor.us_out_max = US_BASE * (MIN(MI_SAMPLE_MAX_1SHUNT_CSVPWM, MI_CHARGE_MAX_CSVPWM));
                /* current sample: 2_shunt */
                }else if(pwm_current.samp_mode == CURRENT_2SHUNT){
                    if(pwm_current.pwm_mode == CSVPWM){
                        motor.us_out_max = US_BASE * (MIN(MI_SAMPLE_MAX_2SHUNT_CSVPWM, MI_CHARGE_MAX_CSVPWM));
                    }else{
                        motor.us_out_max = US_BASE * (MIN(MI_SAMPLE_MAX_2SHUNT_DSVPWMMIN, MI_CHARGE_MAX_DSVPWMMIN));
                   }
                /* current sample: 3_shunt */
                }else{
                    if(pwm_current.pwm_mode == CSVPWM){
                        motor.us_out_max = US_BASE * (MIN(MI_SAMPLE_MAX_3SHUNT_CSVPWM, MI_CHARGE_MAX_CSVPWM));
                    }else{
                        motor.us_out_max = US_BASE * (MIN(MI_SAMPLE_MAX_3SHUNT_DSVPWMMIN, MI_CHARGE_MAX_DSVPWMMIN));
                   }
                }

                /* change menu and state */
                motor.state = MC_STATE_INIT;
                func_index = menu_table[func_index].enter_index;
                
                if((pwm_current.samp_mode == CURRENT_1SHUNT)&&(pwm_current.pwm_mode == DSVPWMMIN)){
                    func_index = menu_table[MENU_HINT].current_index;
                }

            }
            break;
        
        case MC_STATE_RUNNING:
            if(key_read_debouncing(KEY_RUN)){
                motor.command = MC_STOP;
                func_index = menu_table[MENU_STATE_HOME].current_index;
                func_index_pre = menu_table[MENU_STATE_HOME].current_index;
                display_menu = menu_table[MENU_STATE_HOME].fun_current_show;
            }
            if(key_read_debouncing(KEY_ENTER)){
                motor.command = MC_BREAK;
                func_index = menu_table[MENU_STATE_HOME].current_index;
                func_index_pre = menu_table[MENU_STATE_HOME].current_index;
                display_menu = menu_table[MENU_STATE_HOME].fun_current_show;
            }
            break;

        case MC_STATE_BRAKE:
            if(key_read_debouncing(KEY_ENTER)){
                motor.command = MC_BREAK;
            }
            break;

        case MC_STATE_FAULT:
            break;
        
        default:
            break;
    }
}

/*!
    \brief      oled flashing routine
    \param[in]  none
    \param[out] none
    \retval     none
*/
void oled_display(void)
{
    if (func_index != func_index_pre)
    {
        display_menu = menu_table[func_index].fun_current_show;
        func_index_pre = func_index;
    }
    oled_clear_all();
    (*display_menu)();
    oled_page_refresh();
}

/*!
    \brief      the LED indicates the current state, which is called in the systick interrupt
    \param[in]  none
    \param[out] none
    \retval     none
*/
void led_sacn_state(void)
{
    static uint16_t k = 0U;
    static uint16_t i = 0,dir=0;
    static  int j=1;
    uint8_t count;

    switch(motor.state){
        case MC_STATE_INIT:
            if(++i == 15U){
                i = 0U;
                if(dir){
                    j++;
                }else{
                    j--;
                }
            }
            if(j == 40U){
                dir = 0U;
            }else if(j == -20){
                dir = 1U;
            }

            if(i < j){
                led_on();
            }else{
                led_off();
            }
        break;

        case MC_STATE_IDLE:
            if(2000U <= ++k){
                k = 0U;
            }

            if(k < 1000U){
                led_on();
            }else{
                led_off();
            }
        break;

        case MC_STATE_RUNNING:
            led_on();
        break;

        case MC_STATE_BRAKE:
            led_on();
        break;

        case MC_STATE_FAULT:
            for(count=0;count<(uint8_t)motor.fault;count++){
                led_on();
                delay_1ms(100);
                led_off();
                delay_1ms(100);
            }
        break;

        default:
        break;
    }
}

/*!
    \brief      initialize keys
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void key_init(void)
{
    /* enable the clock of GPIO and alternate function */
    rcu_periph_clock_enable(KEY_START_STOP_GPIO_CLK);
    rcu_periph_clock_enable(KEY_ENTER_GPIO_CLK);
    rcu_periph_clock_enable(RCU_AF);

    /* RUN, BRAKE, FUNCTION key initialize */
    gpio_mode_set(KEY_START_STOP_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_NONE, KEY_START_STOP_PIN);
    gpio_mode_set(KEY_ENTER_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_NONE, KEY_ENTER_PIN);
}

/*!
    \brief      read the state of the key
    \param[in]  none
    \param[out] none
    \retval     the state of the key
*/
static FlagStatus key_read(key_switch_enum key)
{
    uint8_t data=0;

    switch(key){
        case KEY_RUN:
            data = gpio_input_bit_get(KEY_START_STOP_GPIO_PORT, KEY_START_STOP_PIN);
        break;
        case KEY_ENTER:
            data = gpio_input_bit_get(KEY_ENTER_GPIO_PORT, KEY_ENTER_PIN);
        break;
        default: data = 0;
    }

    if(data){
        return RESET;
    }

    return SET;
}

/*!
    \brief      key read debouncing
    \param[in]  none
    \param[out] none
    \retval     none
*/
static FlagStatus key_read_debouncing(key_switch_enum key)
{
    if(key_read(key)){
        soft_delay_ms(20);
        if(key_read(key)){
            /* intermittent examination, press release to start */
            while(SET == key_read(key));
            return SET;
        }
    }
    return RESET;
}

/*!
    \brief      initialize the EC11 port
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void ec_init(void)
{
    /* enable the clock of GPIO */
    rcu_periph_clock_enable(EC11_A_GPIO_CLK);
    rcu_periph_clock_enable(EC11_B_GPIO_CLK);
    rcu_periph_clock_enable(RCU_AF);
    
