wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
    /* port A config */
    /* configure button pin A as input */
    /* configure button pin as input */
    gpio_mode_set(EC11_A_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, EC11_A_GPIO_PIN);
    gpio_output_options_set(EC11_A_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL3, EC11_A_GPIO_PIN);
    /* connect key EXTI line to key GPIO pin */
    gpio_exti_source_select(EC11_A_EXTI_SRC_PORT, EC11_A_EXTI_SRC_PIN);
    /* configure key EXTI line */
    exti_init(EC11_A_EXTI_LINE, EXTI_INTERRUPT, EC11_A_EXTI_LINE_EDGE);
    exti_interrupt_flag_clear(EC11_A_EXTI_LINE);

    /* port B config */
    /* configure button pin B as input */
    gpio_mode_set(EC11_B_GPIO_PORT, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, EC11_B_GPIO_PIN);
    gpio_output_options_set(EC11_B_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL3, EC11_B_GPIO_PIN);
    /* connect key EXTI line to key GPIO pin */
    gpio_exti_source_select(EC11_B_EXTI_SRC_PORT, EC11_B_EXTI_SRC_PIN);
    /* configure key EXTI line */
    exti_init(EC11_B_EXTI_LINE, EXTI_INTERRUPT, EC11_B_EXTI_LINE_EDGE);
    exti_interrupt_flag_clear(EC11_B_EXTI_LINE);

    /* enable and set key EXTI interrupt to the lowest priority */
    nvic_irq_enable(EC11_EXTI_IRQ, 3U, 0U);
}

/*!
    \brief      initialize the GPIO port of LED
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void led_init(void)
{
    /* enable the clock of GPIO */
    rcu_periph_clock_enable(LED_GPIO_CLK);
    
    /* led initialize */
    gpio_mode_set(LED_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED_PIN);
    gpio_output_options_set(LED_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL2, LED_PIN);
    
    /* turn off all the led */
    led_off();
}

/*!
    \brief      turn on the selection LED 
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void led_on(void)
{
    gpio_bit_set(LED_GPIO_PORT, LED_PIN);
}

/*!
    \brief      turn off the selection LED 
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void led_off(void)
{
    gpio_bit_reset(LED_GPIO_PORT, LED_PIN);
}

/*!
    \brief      reset I2C gpio configure
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_gpio_reset(void)
{
    /* reset I2C_SCL_PIN and I2C_SDA_PIN */
    gpio_mode_set(SH1106_I2C_SCL_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, SH1106_I2C_SCL_PIN);
    gpio_output_options_set(SH1106_I2C_SCL_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL3, SH1106_I2C_SCL_PIN);
    gpio_mode_set(SH1106_I2C_SDA_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, SH1106_I2C_SDA_PIN);
    gpio_output_options_set(SH1106_I2C_SDA_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL3, SH1106_I2C_SDA_PIN);
}

/*!
    \brief      reset i2c bus
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_bus_reset()
{
    /* configure SDA/SCL for GPIO */
    GPIO_BC(SH1106_I2C_SCL_PORT) |= SH1106_I2C_SCL_PIN;
    GPIO_BC(SH1106_I2C_SDA_PORT) |= SH1106_I2C_SDA_PIN;
    /* reset I2C_SCL_PIN and I2C_SDA_PIN */
    i2c_gpio_reset();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    /* stop signal */
    GPIO_BOP(SH1106_I2C_SCL_PORT) |= SH1106_I2C_SCL_PIN;
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    __NOP();
    GPIO_BOP(SH1106_I2C_SDA_PORT) |= SH1106_I2C_SDA_PIN;
    /* connect I2C_SCL_PIN to I2C_SCL */
    /* connect I2C_SDA_PIN to I2C_SDA */
    gpio_mode_set(SH1106_I2C_SCL_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, SH1106_I2C_SCL_PIN);
    gpio_output_options_set(SH1106_I2C_SCL_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_LEVEL2, SH1106_I2C_SCL_PIN);
    gpio_mode_set(SH1106_I2C_SDA_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, SH1106_I2C_SDA_PIN);
    gpio_output_options_set(SH1106_I2C_SDA_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_LEVEL2, SH1106_I2C_SDA_PIN);
}

/*!
    \brief      initialize the SH1106
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void oled_init(void)
{
    i2c_config();                                       /* I2C interface initialization */

    oled_write_byte(0xAE,SH1106_CMD);                   /* sleep mode, turn off oled panel */
    
    oled_write_byte(0x02,SH1106_CMD);                   /* set lower column address */
    
    oled_write_byte(0x10,SH1106_CMD);                   /* set higher column address */
    
    oled_write_byte(0x40,SH1106_CMD);                   /* set display start line */
    
    oled_write_byte(0xB0,SH1106_CMD);                   /* set display start line */

    oled_write_byte(0x81,SH1106_CMD);                   /* double-byte command£ºset contrast control register */
    oled_write_byte(SH1106_BRIGHTNESS,SH1106_CMD);      /* double-byte command£ºset seg output brightness, 0x00-0xff */

    oled_write_byte(0xA0,SH1106_CMD);                   /* set seg/column mapping, column address 0 is mapped to seg0 */
    
    oled_write_byte(0xA6,SH1106_CMD);                   /* set normal display, 0 is OFF display and 1 is ON display */
    
    oled_write_byte(0xA8,SH1106_CMD);                   /* double-byte command£ºset multiplex ratio, 0x0f-0x3f */
    oled_write_byte(0x3F,SH1106_CMD);                   /* double-byte command£º1/64 duty */

    oled_write_byte(0xAD,SH1106_CMD);                   /* set charge pump enable */
    oled_write_byte(0x8B,SH1106_CMD);                   /* 0x8B ÄÚ¹© VCC */
    
    oled_write_byte(0x33,SH1106_CMD);                   /* 0x33 set VPP 9V */ 
    
    oled_write_byte(0xC0,SH1106_CMD);                   /* set com/row scan direction, scan from com[0] to com[n-1] */
    
    oled_write_byte(0xD3,SH1106_CMD);                   /* double-byte command£ºset vertical shift by com from 0d~63d */
    oled_write_byte(0x00,SH1106_CMD);                   /* double-byte command£ºnot offset */

    oled_write_byte(0xD5,SH1106_CMD);                   /* double-byte command£ºset display clock divide ratio/oscillator frequency */
    oled_write_byte(0x80,SH1106_CMD);                   /* double-byte command£ºdivide ratio is 1, use the default internal clock */
    
    oled_write_byte(0xD9,SH1106_CMD);                   /* double-byte command£ºset pre-charge period */
    oled_write_byte(0xF1,SH1106_CMD);                   /* double-byte command£ºset pre-charge as 15 clocks & discharge as 1 clock */

