wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
    oled_write_byte(0xDA,SH1106_CMD);                   /* double-byte command£ºset com pins hardware configuration */
    oled_write_byte(0x12,SH1106_CMD);                   /* double-byte command£ºsequential com pin configuration and disable com left/right remap */

    oled_write_byte(0xDB,SH1106_CMD);                   /* double-byte command£ºadjusts the Vcomh regulator output */
    oled_write_byte(0x30,SH1106_CMD);                   /* double-byte command£ºSet Vcom to 0.83Vcc */

    oled_clear_all();
    oled_page_refresh();
    oled_write_byte(0xAF,SH1106_CMD);                   /* normal mode, turn on oled panel */
    
    oled_display_reverse(DISABLE);                      /* disable oled display reverse */
    oled_flip_horizontal(DISABLE);                      /* disable oled display flip horizontally */
    oled_clear(0);
    
    oled_parameter_init();
}

/*!
    \brief      initialize the oled parameter
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void oled_parameter_init(void)
{
    func_index = menu_table[MENU_START_PAGE].current_index;
    func_index_pre = menu_table[MENU_START_PAGE].current_index;
    display_menu = menu_table[MENU_START_PAGE].fun_current_show;
}

/*!
    \brief      I2C configuration for SH1106
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c_config(void)
{
    /* configure GPIO clock */
    rcu_periph_clock_enable(SH1106_I2C_SDA_CLK);
    rcu_periph_clock_enable(SH1106_I2C_SCL_CLK);
    /* configure GPIO remap */
    rcu_periph_clock_enable(RCU_AF);
    rcu_periph_clock_enable(SH1106_I2C_CLK);
    /* configure GPIO */
    gpio_mode_set(SH1106_I2C_SDA_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, SH1106_I2C_SDA_PIN);
    gpio_output_options_set(SH1106_I2C_SDA_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_LEVEL2, SH1106_I2C_SDA_PIN);
    gpio_af_set(SH1106_I2C_SDA_PORT, GPIO_AF_0, SH1106_I2C_SDA_PIN);
    
    gpio_mode_set(SH1106_I2C_SCL_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, SH1106_I2C_SCL_PIN);
    gpio_output_options_set(SH1106_I2C_SCL_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_LEVEL2, SH1106_I2C_SCL_PIN);
    gpio_af_set(SH1106_I2C_SCL_PORT, GPIO_AF_0, SH1106_I2C_SCL_PIN);
    
    
    /* I2C clock configure */
    i2c_timing_config(SH1106_I2C_PERIPHERAL, 0x0, 0xC, 0);
    i2c_master_clock_config(SH1106_I2C_PERIPHERAL, 0x4B, 0xE9);

    /* configure I2C address */
    i2c_address_config(SH1106_I2C_PERIPHERAL, SH1106_I2C_SLAVE_ADDRESS7, I2C_ADDFORMAT_7BITS);
    /* send slave address to I2C bus */
    i2c_master_addressing(SH1106_I2C_PERIPHERAL, SH1106_I2C_SLAVE_ADDRESS7, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(SH1106_I2C_PERIPHERAL, 2);
    /* enable I2C0 */
    i2c_enable(SH1106_I2C_PERIPHERAL);
}

/*!
    \brief      write data or command to oled module
    \param[in]  data: transport data 
    \param[in]  type: transport type
    \param[out] none
    \retval     none
*/
static void oled_write_byte(uint8_t data, sh1106_cmd_enum type)
{
    uint8_t first_byte;
    i2c_process_enum state = I2C_START;
    uint16_t timeout = 0;
    uint8_t end_flag = 0;
    uint16_t number_of_byte = 1;
    
    if(type){
        first_byte = 0x40;
    }else{
        first_byte = 0x00;
    }
    while(!end_flag) {
        switch(state) {
            case I2C_START:
                /* configure slave address */
                i2c_master_addressing(I2C0, SH1106_I2C_SLAVE_ADDRESS7, I2C_MASTER_TRANSMIT);
                /* configure number of bytes to be transferred */
                i2c_transfer_byte_number_config(I2C0, number_of_byte + 1);
                /* enable I2C automatic end mode in master mode */
                i2c_automatic_end_enable(I2C0);
                /* i2c master sends start signal only when the bus is idle */
                while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY) && (timeout < SH1106_I2C_TIMEOUT)) {
                    timeout++;
                }
                if(timeout < SH1106_I2C_TIMEOUT) {
                    i2c_start_on_bus(I2C0);
                    timeout = 0;
                    state = I2C_SEND_ADDRESS;
                    /* clear I2C_TDATA register */
                    I2C_STAT(I2C0) |= I2C_STAT_TBE;
                } else {
                    /* timeout, bus reset */
                    i2c_bus_reset();
                    timeout = 0;
                    state = I2C_START;
                }
                break;
            case I2C_SEND_ADDRESS:
                /* wait until the transmit data buffer is empty */
                while((!i2c_flag_get(I2C0, I2C_FLAG_TBE)) && (timeout < SH1106_I2C_TIMEOUT)) {
                    timeout++;
                }
                if(timeout < SH1106_I2C_TIMEOUT) {
                    /* send the EEPROM's internal address to write to : only one byte address */
                    i2c_data_transmit(I2C0, first_byte);
                    timeout = 0;
                    state = I2C_TRANSMIT_DATA;
                } else {
                    timeout = 0;
                    state = I2C_START;
                }
                break;
            case I2C_TRANSMIT_DATA:
                while(number_of_byte--) {
                    /* wait until TI bit is set */
                    while((!i2c_flag_get(I2C0, I2C_FLAG_TBE)) && (timeout < SH1106_I2C_TIMEOUT)) {
                        timeout++;
                    }
                    if(timeout < SH1106_I2C_TIMEOUT) {
                        /* while there is data to be written */
                        i2c_data_transmit(I2C0, data);
                        /* point to the next byte to be written */
                        timeout = 0;
                        state = I2C_STOP;
                    } else {
                        /* wait TI timeout */
                        timeout = 0;
                        state = I2C_START;
                        return ;
                    }
                }
                break;
            case I2C_STOP:
                /* wait until the stop condition is finished */
                while((!i2c_flag_get(I2C0, I2C_FLAG_STPDET)) && (timeout < SH1106_I2C_TIMEOUT)) {
                    timeout++;
                }
                if(timeout < SH1106_I2C_TIMEOUT) {
                    /* clear STPDET flag */
                    i2c_flag_clear(I2C0, I2C_FLAG_STPDET);
                    timeout = 0;
                    state = I2C_END;
                    end_flag = 1;
                } else {
                    /* stop detect timeout */
                    timeout = 0;
                    state = I2C_START;
                }
                break;
            default:
                /* default status */
                state = I2C_START;
                end_flag = 1;
                timeout = 0;
                break;
        }
    }
}

/*!
    \brief      power calculation
    \param[in]  m: the base number
    \param[in]  n: the index number
    \param[out] none
    \retval     none
*/
static uint32_t oled_pow(uint8_t m,uint8_t n)
{
    uint32_t result = 1;

    while(n--){
        result*=m;
    }

    return result;
}

/*!
    \brief      clear all oled display
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void oled_clear_all(void)
{
    uint8_t i,n;

