wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
    for(i=0;i<SH1106_PAGE_LENGTH;i++){
        for(n=0;n<SH1106_COLUMN_LENGTH;n++){
            oled_buffer[n][i] = 0;
        }
    }
}

/*!
    \brief      clear page oled
    \param[in]  page:0~(SH1106_PAGE_LENGTH -1)
    \param[out] none
    \retval     none
*/
static void oled_clear(uint8_t page)
{
    uint8_t n;
    /* set page start address for page addressing mode(B0h~B7h) */
    oled_write_byte (0xB0+page,SH1106_CMD);
    /* set lower column start address for page addressing mode(00h~0Fh) */
    oled_write_byte (0x02,SH1106_CMD);
    /* set higher column start address for page addressing mode(10h~1Fh) */
    oled_write_byte (0x10,SH1106_CMD);

    for(n=0;n<SH1106_COLUMN_LENGTH;n++){
        oled_write_byte(0,SH1106_DATA);
    }
}

/*!
    \brief      set oled display reverse
    \param[in]  reverse: ENABLE(reverse display),DISABLE(normal display)
    \param[out] none
    \retval     none
*/
static void oled_display_reverse(ControlStatus reverse)
{
    if(ENABLE == reverse){
        oled_write_byte(0xA7,SH1106_CMD);
    }else {
        oled_write_byte(0xA6,SH1106_CMD);
    }
}

/*!
    \brief      oled display flip horizontally
    \param[in]  flip: ENABLE(flip horizontal),DISABLE(normal display)
    \param[out] none
    \retval     none
*/
static void oled_flip_horizontal(ControlStatus flip)
{
    if(ENABLE == flip){
        oled_write_byte(0xC8,SH1106_CMD);
        oled_write_byte(0xA1,SH1106_CMD);
    }else {
        oled_write_byte(0xC0,SH1106_CMD);
        oled_write_byte(0xA0,SH1106_CMD);
    }
}

/*!
    \brief      refresh oled screen
    \param[in]  none 
    \param[out] none
    \retval     none
*/
static void oled_page_refresh(void)
{
    uint8_t i,n;
    /* display update */
    for(i=0;i<SH1106_PAGE_LENGTH;i++){
        /* set page start address for page addressing mode(B0h~B7h) */
        oled_write_byte (0xB0+i,SH1106_CMD);
        /* set lower column start address for page addressing mode(00h~0Fh) */
        oled_write_byte (0x02,SH1106_CMD);
        /* set higher column start address for page addressing mode(10h~1Fh) */
        oled_write_byte (0x10,SH1106_CMD);

        for(n=0;n<SH1106_COLUMN_LENGTH;n++){
            oled_write_byte(oled_buffer[n][i],SH1106_DATA);
        }
    }
}

/*!
    \brief      display a point
    \param[in]  x: position of point, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  y: position of point, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  value: 0 or 1
    \retval     none
*/
static void oled_draw_point(uint8_t x, uint8_t y, uint8_t value)
{
    uint8_t i,bit,temp;
    
    if((x<SH1106_COLUMN_LENGTH)&&(y<SH1106_ROW_LENGTH)){
        /* locate the page */
        i = y>>3;
        bit = y%8;
        temp = 0x01<<bit;
        
        if(value == 1){
            oled_buffer[x][i] |= temp;
        }else{
            oled_buffer[x][i] &= (~temp);
        }
    }
}

/*!
    \brief      display a picture
    \param[in]  x: starting point, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  y: starting point, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  sizex: size of column, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  sizey: size of row, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  picture: input data
    \retval     none
*/
static void oled_show_picture(uint8_t x, uint8_t y, uint8_t sizex, uint8_t sizey, uint8_t picture[])
{
    uint16_t j=0;
    uint8_t i,m, n,temp;
    uint8_t x0=x,y0=y;
    
    /* page size of picture */
    sizey=sizey/8+((sizey%8)?1:0);
    
    
    for(n=0;n<sizey;n++){
        /* scan page */
        for(i=0;i<sizex;i++){
            /* scan column */
            temp=picture[j++];
            for(m=0;m<8;m++){
                /* scan point */
                if(temp&0x01)
                    oled_draw_point(x,y,1);
                else 
                    oled_draw_point(x,y,0);
                temp>>=1;
                y++;
            }
            /* column increase */
            x++;
            if((x-x0)==sizex){
                x=x0;
                /* next page */
                y0=y0+8;
            }
            y=y0;
        }
    }
}

/*!
    \brief      display a characters
    \param[in]  x: starting point, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  y: starting point, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  chr: characters
    \param[in]  size1: font size
    \retval     none
*/
static void oled_show_char(uint8_t x,uint8_t y,uint8_t chr,oled_font_enum size)
{
    uint8_t i,m,temp,len,chr1;
    uint8_t x0=x,y0=y;
    
    /* get num of bytes occupied by a font character corresponding to a lattice set */
    if(size==FONT_6_8)
        len=6;
    else 
        len=(size/8+((size%8)?1:0))*(size/2);
    
    /* get offset value */
    chr1=chr-' '; 

    for(i=0;i<len;i++){
        /* scan a character */
        if(size == FONT_6_8)
            temp=asc2_0806[chr1][i]; 
        else if(size == FONT_8_16)
            temp=asc2_1608[chr1][i];
        else if(size == FONT_12_24)
            temp=asc2_2412[chr1][i];
        else 
            return;
        /* scan point */
        for(m=0;m<8;m++){
            if(temp&0x01)
                oled_draw_point(x,y,1);
            else 
                oled_draw_point(x,y,0);
            temp>>=1;
            y++;
        }
        /* column increase */
        x++;
        if((size!=FONT_6_8)&&((x-x0)==size/2)){
            x=x0;
            /* next page */
            y0=y0+8;
        }
        y=y0;
  }
}

/*!
    \brief      show a string
    \param[in]  x: starting point, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  y: starting point, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  chr: string
    \param[in]  size1: font size
    \retval     none
*/
static void oled_show_string(uint8_t x,uint8_t y,uint8_t *chr,oled_font_enum size)
{
    while((*chr >= ' ')&&(*chr <= '~')){
        /* show a character */
        oled_show_char(x,y,*chr,size);
        /* next character */
        if(size == FONT_6_8)
            x+=6;
        else 
            x+=size/2;
        chr++;
    }
}

/*!
    \brief      display a number at the specified location
    \param[in]  x: the horizontal direction, 0-127
    \param[in]  y: the vertical direction, 0-7
    \param[in]  num: the displaying number
    \param[in]  len: the number length
    \param[in]  size1: the font type
    \param[out] none
    \retval     none
*/
static void oled_show_num(uint8_t x, uint8_t y, uint16_t num, uint8_t len, oled_font_enum size)
{
    uint8_t t,temp,m=0;
    
    /*  */
    if(size==FONT_6_8)
        m=2;
    
    /* sacn each number from high to low */
    for(t=0;t<len;t++){
        /* get the digit */
        temp=(num/oled_pow(10,len-t-1))%10;
        /* show num */
        if(temp==0){
            oled_show_char(x+(size/2+m)*t,y,'0',size);
        }else{
            oled_show_char(x+(size/2+m)*t,y,temp+'0',size);
        }
  }
}

/*!
    \brief      display a line at the specified location
    \param[in]  x: the horizontal direction, 0-127
    \param[in]  y: the vertical direction, 0-7
    \param[in]  num: the displaying number
    \param[in]  len: the number length
    \param[in]  size1: the font type
    \param[out] none
    \retval     none
*/
static void oled_show_line(uint8_t x1,uint8_t y1,uint8_t x2,uint8_t y2)
{
    uint16_t t; 
    int16_t xerr=0,yerr=0,delta_x,delta_y,distance;
    int16_t incx,incy,row,col;
    
    /* calculate the delta x and delta y */
    delta_x=x2-x1; 
    delta_y=y2-y1;
    
    /* get the starting point */
    row=x1;
    col=y1;
    
