wajmh/Code/Application/BLDC_FOC_72V_10A_Demo/GD32F503R_Full/Src/gd32_bldc_foc_eval.c
    /* x direction */
    if(delta_x>0){
        incx=1; 
    }else if(delta_x==0){
        incx=0;
    }else{
        incx=-1;
        delta_x=-delta_x;
    }
    
    /* y direction */
    if(delta_y>0){
        incy=1;
    }else if (delta_y==0){
        incy=0;
    }else{
        incy=-1;
        delta_y=-delta_y;
    }
    
    /* make sure which basis is used to self-increment */
    if(delta_x>delta_y){
        distance=delta_x;
    }else{
        distance=delta_y;
    }
    
    /* draw a line */
    for(t=0;t<distance+1;t++){
        oled_draw_point(row,col,1);
        xerr+=delta_x;
        yerr+=delta_y;
        if(xerr>distance){
            xerr-=distance;
            row+=incx;
        }
        if(yerr>distance){
            yerr-=distance;
            col+=incy;
        }
    }
}

/*!
    \brief      show index start page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index_start(void)
{
    uint8_t i,n;

    /* display the logo */
    for(i=0;i<8;i++){
        /* set page start address for page addressing mode(B0h~B7h) */
        oled_write_byte (0xB0+i,SH1106_CMD);
        /* set lower column start address for page addressing mode(00h~0Fh) */
        oled_write_byte (0x00,SH1106_CMD);
        /* set higher column start address for page addressing mode(10h~1Fh) */
        oled_write_byte (0x10,SH1106_CMD);

        /* white space */
        for(n=0;n<18;n++){
            oled_write_byte(0,SH1106_DATA);
        }
        /* loga data */
        for(n=0;n<86;n++){
            oled_write_byte(gImage_logo[i*86+n],SH1106_DATA);
        }
        delay_1ms(100);
    }
    delay_1ms(1000);
}

/*!
    \brief      show index 0 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index1_0(void)
{
    uint16_t speed_temp, ref_speed_temp;
    uint8_t num_length, ref_num_length;
    
    /* display speed */
    if(motor.mech_speed>0){
        speed_temp = (uint16_t)motor.mech_speed;
    }else{
        speed_temp = -(uint16_t)motor.mech_speed;
    }
    if(speed_temp<10){
        num_length = 1;
    }else if(speed_temp<100){
        num_length = 2;
    }else if(speed_temp<1000){
        num_length = 3;
    }else if(speed_temp<10000){
        num_length = 4;
    }else{
        num_length = 5;
    }
    
    if(motor.speed_ref>0){
        ref_speed_temp = motor.speed_ref;
    }else{
        ref_speed_temp = -motor.speed_ref;
    }
    if(ref_speed_temp<10){
        ref_num_length = 1;
    }else if(ref_speed_temp<100){
        ref_num_length = 2;
    }else if(ref_speed_temp<1000){
        ref_num_length = 3;
    }else if(ref_speed_temp<10000){
        ref_num_length = 4;
    }else{
        ref_num_length = 5;
    }

    /* PAGE1*/
    if(motor.state != MC_STATE_RUNNING){
        oled_show_string(3,19,(uint8_t*)"STATE:",FONT_6_8);
        oled_show_string(43,5,state_database[motor.state],FONT_12_24);
    }else{
        oled_show_string(3,19,(uint8_t*)"SPEED:",FONT_6_8);
        oled_show_num(43,5,speed_temp,num_length,FONT_12_24);
        oled_show_string(104,19,(uint8_t*)"rpm",FONT_6_8);
    
    }
    oled_show_string(3,38,(uint8_t*)"SPEED_REF:",FONT_6_8);
    if((rotor_angle.pos_mode != HALL_DETECT_MODE)&&(rotor_angle.pos_mode != ANGLE_CUSTOM_MODE)) {
        oled_show_num(68,38,ref_speed_temp,ref_num_length,FONT_6_8);
        oled_show_string(104,38,(uint8_t*)"rpm",FONT_6_8);
    }else{
        oled_show_string(68,38,(uint8_t*)"INVALID",FONT_6_8);
    }

    
    oled_show_line(2,2,125,2);
    oled_show_line(2,2,2,48);
    oled_show_line(2,48,125,48);
    oled_show_line(125,2,125,48);

    oled_show_string(3,53,(uint8_t*)"FAULT:",FONT_6_8);
    oled_show_string(43,53,fault_database[motor.fault],FONT_6_8);

    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 1 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index1_1(void)
{
    oled_show_string(20,2,(uint8_t*)"--SETTING--",FONT_8_16);
    oled_show_string(3,17,(uint8_t*)"MODE: ",FONT_6_8);
    oled_show_string(35,17,mode_database[motor.running_mode],FONT_6_8);
    oled_show_string(3,29,(uint8_t*)"DIR : ",FONT_6_8);
    oled_show_string(35,29,direction_database[motor.direction],FONT_6_8);
    oled_show_string(3,41,(uint8_t*)"SAMP: ",FONT_6_8);
    oled_show_string(35,41,sample_database[pwm_current.samp_mode],FONT_6_8);    
    oled_show_string(3,53,(uint8_t*)"PWM : ",FONT_6_8);
    oled_show_string(35,53,modulation_database[pwm_current.pwm_mode],FONT_6_8);
    oled_show_picture(112,50,11,11,arrow_11_11_right);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
    /*  */
    oled_show_qr_code(91,25);
}

/*!
    \brief      show index 2 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index2_2(void)
{
    oled_show_picture(43,5,43,42,mode_select_43_42);
    oled_show_picture(5,50,11,11,arrow_11_11_left);
    oled_show_picture(112,50,11,11,arrow_11_11_right);
    oled_show_string(20,48,(uint8_t*)"MODE SELECT",FONT_8_16);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 3 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index2_3(void)
{
    oled_show_picture(43,5,43,42,direction_config_43_42);
    oled_show_picture(5,50,11,11,arrow_11_11_left);
    oled_show_picture(112,50,11,11,arrow_11_11_right);
    oled_show_string(20,48,(uint8_t*)" DIRECTION",FONT_8_16);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 4 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index2_4(void)
{
    oled_show_picture(43,5,43,42,current_sampling_43_42);
    oled_show_picture(5,50,11,11,arrow_11_11_left);
    oled_show_picture(112,50,11,11,arrow_11_11_right);
    oled_show_string(20,48,(uint8_t*)"SAMPLE MODE",FONT_8_16);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 5 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index2_5(void)
{
    oled_show_picture(43,5,43,42,modulation_set_43_42);
    oled_show_picture(5,50,11,11,arrow_11_11_left);
    oled_show_string(20,48,(uint8_t*)"  PWM MODE",FONT_8_16);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 7 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_7(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[0],FONT_6_8);
    oled_show_string(18,17,mode_database[1],FONT_6_8);
    oled_show_string(18,29,mode_database[2],FONT_6_8);
    oled_show_string(18,41,mode_database[3],FONT_6_8);
    oled_show_string(18,53,mode_database[4],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 8 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_8(void)
{
    oled_show_picture(3,15,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[0],FONT_6_8);
    oled_show_string(18,17,mode_database[1],FONT_6_8);
    oled_show_string(18,29,mode_database[2],FONT_6_8);
    oled_show_string(18,41,mode_database[3],FONT_6_8);
    oled_show_string(18,53,mode_database[4],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 9 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_9(void)
{
    oled_show_picture(3,27,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[0],FONT_6_8);
    oled_show_string(18,17,mode_database[1],FONT_6_8);
    oled_show_string(18,29,mode_database[2],FONT_6_8);
    oled_show_string(18,41,mode_database[3],FONT_6_8);
    oled_show_string(18,53,mode_database[4],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 10 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_10(void)
{
    oled_show_picture(3,39,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[0],FONT_6_8);
    oled_show_string(18,17,mode_database[1],FONT_6_8);
    oled_show_string(18,29,mode_database[2],FONT_6_8);
    oled_show_string(18,41,mode_database[3],FONT_6_8);
    oled_show_string(18,53,mode_database[4],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 11 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_11(void)
{
    oled_show_picture(3,51,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[0],FONT_6_8);
    oled_show_string(18,17,mode_database[1],FONT_6_8);
    oled_show_string(18,29,mode_database[2],FONT_6_8);
    oled_show_string(18,41,mode_database[3],FONT_6_8);
    oled_show_string(18,53,mode_database[4],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 12 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_12(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[5],FONT_6_8);
    oled_show_string(18,17,mode_database[6],FONT_6_8);
    oled_show_string(18,29,mode_database[7],FONT_6_8);
    oled_show_string(18,41,mode_database[8],FONT_6_8);
    oled_show_string(18,53,mode_database[9],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 13 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_13(void)
{
    oled_show_picture(3,15,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[5],FONT_6_8);
    oled_show_string(18,17,mode_database[6],FONT_6_8);
    oled_show_string(18,29,mode_database[7],FONT_6_8);
    oled_show_string(18,41,mode_database[8],FONT_6_8);
    oled_show_string(18,53,mode_database[9],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 14 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_14(void)
{
    oled_show_picture(3,27,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[5],FONT_6_8);
    oled_show_string(18,17,mode_database[6],FONT_6_8);
    oled_show_string(18,29,mode_database[7],FONT_6_8);
    oled_show_string(18,41,mode_database[8],FONT_6_8);
    oled_show_string(18,53,mode_database[9],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

 /*!
    \brief      show index 15 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_15(void)
{
    oled_show_picture(3,39,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[5],FONT_6_8);
    oled_show_string(18,17,mode_database[6],FONT_6_8);
    oled_show_string(18,29,mode_database[7],FONT_6_8);
    oled_show_string(18,41,mode_database[8],FONT_6_8);
    oled_show_string(18,53,mode_database[9],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

 /*!
    \brief      show index 16 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_16(void)
{
    oled_show_picture(3,51,11,11,arrow_11_11_right);
    oled_show_string(18,5,mode_database[5],FONT_6_8);
    oled_show_string(18,17,mode_database[6],FONT_6_8);
    oled_show_string(18,29,mode_database[7],FONT_6_8);
    oled_show_string(18,41,mode_database[8],FONT_6_8);
    oled_show_string(18,53,mode_database[9],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 17 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_17(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,direction_database[0],FONT_6_8);
    oled_show_string(18,17,direction_database[1],FONT_6_8);

    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 18 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_18(void)
{
    oled_show_picture(3,15,11,11,arrow_11_11_right);
    oled_show_string(18,5,direction_database[0],FONT_6_8);
    oled_show_string(18,17,direction_database[1],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 19 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_19(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,sample_database[0],FONT_6_8);
    oled_show_string(18,17,sample_database[1],FONT_6_8);
    oled_show_string(18,29,sample_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 20 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_20(void)
{
    oled_show_picture(3,15,11,11,arrow_11_11_right);
    oled_show_string(18,5,sample_database[0],FONT_6_8);
    oled_show_string(18,17,sample_database[1],FONT_6_8);
    oled_show_string(18,29,sample_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 21 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_21(void)
{
    oled_show_picture(3,27,11,11,arrow_11_11_right);
    oled_show_string(18,5,sample_database[0],FONT_6_8);
    oled_show_string(18,17,sample_database[1],FONT_6_8);
    oled_show_string(18,29,sample_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 22 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_22(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,modulation_database[0],FONT_6_8);
    oled_show_string(18,17,modulation_database[1],FONT_6_8);
    oled_show_string(18,29,modulation_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 23 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_23(void)
{
    oled_show_picture(3,3,11,11,arrow_11_11_right);
    oled_show_string(18,5,modulation_database[1],FONT_6_8);
    oled_show_string(18,17,modulation_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index 24 page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index3_24(void)
{
    oled_show_picture(3,15,11,11,arrow_11_11_right);
    oled_show_string(18,5,modulation_database[1],FONT_6_8);
    oled_show_string(18,17,modulation_database[2],FONT_6_8);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show index hint page
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void fun_index_hint(void)
{
    oled_show_string(20,2,(uint8_t*)"--WARNING--",FONT_8_16);
    oled_show_string(8,25,(uint8_t*)"You can't use",FONT_6_8);
    oled_show_string(8,35,(uint8_t*)"1_Shunt and DSVPWM",FONT_6_8);
    oled_show_string(8,45,(uint8_t*)"at the same time!!!",FONT_6_8);
     pwm_current.pwm_mode = CSVPWM;

    /* display a rectangular box */
    oled_show_line(3,3,125,3);
    oled_show_line(3,3,3,61);
    oled_show_line(3,61,125,61);
    oled_show_line(125,3,125,61);
    /* display a rectangular box */
    oled_show_line(0,0,127,0);
    oled_show_line(0,0,0,63);
    oled_show_line(0,63,127,63);
    oled_show_line(127,0,127,63);
}

/*!
    \brief      show QR code
    \param[in]  x: starting point, 0 ~ (SH1106_COLUMN_LENGTH - 1)
    \param[in]  y: starting point, 0 ~ (SH1106_ROW_LENGTH - 1)
    \param[in]  chr: string
    \param[in]  size1: font size
    \retval     none
*/
static void oled_show_qr_code(uint8_t x,uint8_t y)
{
    uint8_t col,row;
    for(row=0;row<25;row++){
        for(col=0;col<25;col++){
        /* scan point */
        if(GDQR_logo[row][col]&0x01)
            oled_draw_point(x+col,y+row,1);
        else 
            oled_draw_point(x+col,y+row,0);
        }
    }
}
